## Development of functions to use on Amazon Lambda for the article "Serverless ETL with Amazon Lambda"

In [2]:
import pandas as pd
import boto3

### 1.1 Exploring Datasets to use on the article
The idea is to choose a dataset that can be use as

In [12]:
df_sp500 = pd.read_csv('sandp500/all_stocks_5yr.csv', index_col='date')

In [13]:
df_sp500.info()

<class 'pandas.core.frame.DataFrame'>
Index: 619040 entries, 2013-02-08 to 2018-02-07
Data columns (total 6 columns):
open      619029 non-null float64
high      619032 non-null float64
low       619032 non-null float64
close     619040 non-null float64
volume    619040 non-null int64
Name      619040 non-null object
dtypes: float64(4), int64(1), object(1)
memory usage: 33.1+ MB

In [15]:
df_sp500.loc['2013-02-08']

               open     high      low    close     volume  Name
date
2013-02-08  15.0700  15.1200  14.6300  14.7500    8407500   AAL
2013-02-08  67.7142  68.4014  66.8928  67.8542  158168416  AAPL
2013-02-08  78.3400  79.7200  78.0100  78.9000    1298137   AAP
2013-02-08  36.3700  36.4200  35.8250  36.2500   13858795  ABBV
2013-02-08  46.5200  46.8950  46.4600  46.8900    1232802   ABC
...             ...      ...      ...      ...        ...   ...
2013-02-08  27.0100  27.6400  27.0100  27.0900    1206284   XYL
2013-02-08  63.7000  65.4900  63.6600  65.3000    7190051   YUM
2013-02-08  75.0200  75.9900  74.9600  75.8500     911179   ZBH
2013-02-08  24.0300  24.2100  23.9500  24.1400    2104483  ZION
2013-02-08  32.3100  33.4800  32.3000  33.0500    2599232   ZTS

[476 rows x 6 columns]